/*
 * =====================================================================================
 *
 *       Filename:  lab11-6.c
 *
 *    Description:  用产生随机数的方法产生：100个商场的序号（1到500之间）、每个商场一年四个季度每个季度的销售金额（单位万元），将这些数据存于数据文件，然后利用该文件求出每个商场一年的销售总金额。
 *
 *        Version:  1.0
 *        Created:  03/12/2014 11:58:11
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  Jackie Kuo, j.kuo2012@gmail.com
 * =====================================================================================
 */


